In [23]:
import pandas as pd

In [24]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [33]:
data  = {
    "Nume" : ["Alina", "Bobby", "Cristi"],
    "Varsta": [11, 22, 33],
    "Gen" : ["F", "B", "B"],
    "Salariu Anual": [100, 2000, 30000]
}


df = pd.DataFrame(data)
df

     Nume  Varsta Gen  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [26]:
print(df)

     Nume  Varsta Gen  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [27]:
data  = {
    "Nume" : ["Alina", "Bobby", "Cristi"],
    "Varsta": [11, 22, 33],
    "Gen" : ["F", "B", "B"],
    "Salariu": [100, 2000, 30000]
}


df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nume     3 non-null      object
 1   Varsta   3 non-null      int64
 2   Gen      3 non-null      object
 3   Salariu  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [28]:
df.describe()

       Varsta      Salariu
count     3.0      3.00000
mean     22.0  10700.00000
std      11.0  16741.26638
min      11.0    100.00000
25%      16.5   1050.00000
50%      22.0   2000.00000
75%      27.5  16000.00000
max      33.0  30000.00000

In [29]:
type(df['Nume'])

pandas.core.series.Series

In [30]:
#df['Nume']
df.Nume

0     Alina
1     Bobby
2    Cristi
Name: Nume, dtype: object

In [34]:
df["Salariu Anual"]

0      100
1     2000
2    30000
Name: Salariu Anual, dtype: int64

In [37]:
df[  [ 'Nume', 'Gen' ]   ]

     Nume Gen
0   Alina   F
1   Bobby   B
2  Cristi   B

In [38]:
df

     Nume  Varsta Gen  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [39]:
df.loc[1, "Varsta"]

np.int64(22)

In [40]:
df.loc[1]

Nume             Bobby
Varsta              22
Gen                  B
Salariu Anual     2000
Name: 1, dtype: object

In [41]:
df['Nume'] == 'Alina'

0     True
1    False
2    False
Name: Nume, dtype: bool

In [42]:
df[df['Nume'] == 'Alina']

    Nume  Varsta Gen  Salariu Anual
0  Alina      11   F            100

In [43]:
conditia = df['Nume'] == 'Alina'

df[conditia]

    Nume  Varsta Gen  Salariu Anual
0  Alina      11   F            100

In [44]:
df

     Nume  Varsta Gen  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [45]:
df.sort_values(by="Nume")

     Nume  Varsta Gen  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [46]:
df.sort_values(by="Nume", ascending=False)

     Nume  Varsta Gen  Salariu Anual
2  Cristi      33   B          30000
1   Bobby      22   B           2000
0   Alina      11   F            100

In [47]:
df.rename(columns={'Gen':'Sex'})

     Nume  Varsta Sex  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [48]:
df

     Nume  Varsta Gen  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [49]:
df.rename(columns={'Gen':'Sex'}, inplace=True)

In [50]:
df

     Nume  Varsta Sex  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [54]:
df.rename(columns={'Gen':'Sex'}, inplace=True)

In [55]:
df.T

                   0      1       2
Nume           Alina  Bobby  Cristi
Varsta            11     22      33
Sex                F      B       B
Salariu Anual    100   2000   30000

In [56]:
df

     Nume  Varsta Sex  Salariu Anual
0   Alina      11   F            100
1   Bobby      22   B           2000
2  Cristi      33   B          30000

In [58]:
df['Salariu Anual'].apply(lambda x: x * 2)

0      200
1     4000
2    60000
Name: Salariu Anual, dtype: int64

In [59]:
df['Salariu Anual Dublat'] = df['Salariu Anual'].apply(lambda x: x * 2)
df

     Nume  Varsta Sex  Salariu Anual  Salariu Anual Dublat
0   Alina      11   F            100                   200
1   Bobby      22   B           2000                  4000
2  Cristi      33   B          30000                 60000

In [60]:
df['Gen'] = df['Sex'].apply(lambda x: "feminin" if x == "F" else "masculin")
df

     Nume  Varsta Sex  Salariu Anual  Salariu Anual Dublat       Gen
0   Alina      11   F            100                   200   feminin
1   Bobby      22   B           2000                  4000  masculin
2  Cristi      33   B          30000                 60000  masculin

In [64]:
df['Gen_v2'] = df['Sex'].map({'F':'feminin', 'B':'masculin'})
df

     Nume  Varsta Sex  Salariu Anual  Salariu Anual Dublat       Gen    Gen_v2
0   Alina      11   F            100                   200   feminin   feminin
1   Bobby      22   B           2000                  4000  masculin  masculin
2  Cristi      33   B          30000                 60000  masculin  masculin